# Salaries data analysis using Pandas

#### Objective:
- Import pandas as pd
- Read Salaries.csv as a dataframe called salary
- Check the head of the DataFrame
- Use the .info() method to find out how many entries there are.
- What is the average BasePay?
- What is the highest amount of OvertimePay in the dataset ?
- Find the job title of any particular person e.g JGARY JIMENEZ ?
- How much does any particular person make e.g GARY JIMENEZ (including benefits)?
- What is the name of highest paid person (including benefits)?
- What is the name of lowest paid person (including benefits)?
- What was the average (mean) BasePay of all employees per year? e.g (2011-2014)
- How many unique job titles are there?
- What are the top 5 most common jobs?
- How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?)
- How many people have the word Chief in their job title?

In [1]:
import pandas as pd

In [2]:
#### Read Salaries.csv as a dataframe called salary

In [3]:
salary = pd.read_csv('Salaries.csv')

In [4]:
#### Check the head of the DataFrame

In [5]:
salary.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [6]:
#### Use the .info() method to find out how many entries there are.

In [7]:
salary.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
Id                  148654 non-null int64
EmployeeName        148654 non-null object
JobTitle            148654 non-null object
BasePay             148045 non-null float64
OvertimePay         148650 non-null float64
OtherPay            148650 non-null float64
Benefits            112491 non-null float64
TotalPay            148654 non-null float64
TotalPayBenefits    148654 non-null float64
Year                148654 non-null int64
Notes               0 non-null float64
Agency              148654 non-null object
Status              0 non-null float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

#### - What is the average BasePay?

In [8]:
salary['BasePay'].mean()

66325.448840487705

#### - What is the highest amount of OvertimePay in the dataset ?

In [9]:
salary['OvertimePay'].max()

245131.88

#### - Find the job title of any particular person e.g GARY JIMENEZ ?

In [10]:
salary[salary['EmployeeName']=='GARY JIMENEZ']['JobTitle']

1    CAPTAIN III (POLICE DEPARTMENT)
Name: JobTitle, dtype: object

In [11]:
# complete row for GARY JIMENEZ
salary[salary['EmployeeName']=='GARY JIMENEZ']

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN

#### - How much does any particular person make e.g GARY JIMENEZ (including benefits)?

In [12]:
salary[salary['EmployeeName']=='GARY JIMENEZ']['TotalPayBenefits']

1    538909.28
Name: TotalPayBenefits, dtype: float64

#### What is the name of highest paid person (including benefits)?

In [13]:
salary[salary['TotalPayBenefits']==salary['TotalPayBenefits'].max()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

In [14]:
# Another way to find the above:
salary.loc[salary['TotalPayBenefits'].idxmax()]['EmployeeName']

'NATHANIEL FORD'

#### What is the name of lowest paid person (including benefits)?

In [15]:
salary[salary['TotalPayBenefits']==salary['TotalPayBenefits'].min()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

In [16]:
# Another way to find the above:
salary.loc[salary['TotalPayBenefits'].idxmin()]['EmployeeName']

'Joe Lopez'

#### What was the average (mean) BasePay of all employees per year? e.g (2011-2014) ?

In [17]:
salary.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

In [18]:
# Average (mean) BasePay only in 2013
salary[salary['Year']==2013]['BasePay'].mean()

69630.030216480649

#### How many unique job titles are there?

In [19]:
salary['JobTitle'].nunique()

2159

#### What are the top 5 most common jobs?

In [20]:
# Top 5:
salary['JobTitle'].value_counts().head(5)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

#### - How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?)

In [21]:
sum(salary[salary['Year']==2013]['JobTitle'].value_counts()==1)

202

#### How many people have the word Chief in their job title?

In [22]:
# Our Dataset is a mixture of lower 'chief' and upper 'Chief', to being everything into account
# we will create a funtion to solve this problem

In [23]:
def chief_string(title):
    if 'chief' in title.lower().split():
        return True
    else:
        return False
    
salary['JobTitle'].apply(lambda x: chief_string(x))

0         False
1         False
2         False
3         False
4          True
5          True
6         False
7         False
8         False
9          True
10         True
11        False
12        False
13        False
14        False
15        False
16        False
17        False
18        False
19        False
20        False
21        False
22        False
23        False
24        False
25         True
26        False
27        False
28         True
29         True
          ...
148624    False
148625    False
148626    False
148627    False
148628    False
148629    False
148630    False
148631    False
148632    False
148633    False
148634    False
148635    False
148636    False
148637    False
148638    False
148639    False
148640    False
148641    False
148642    False
148643    False
148644    False
148645    False
148646    False
148647    False
148648    False
148649    False
148650    False
148651    False
148652    False
148653    False
Name: JobTitle, Length: 148654, dtype: bool

In [24]:
# To sum all True values
sum(salary['JobTitle'].apply(lambda x: chief_string(x)))

477